# Задача 3
a= int(input("Введите размер партии товаров №1:"))
b= int(input("Введите размер партии товаров №2:"))
c= int(input("Введите размер партии товаров №3:"))
d= int(input("Введите размер ящика:"))
z=(a+b+c)/d
print(int(z))